In [1]:
import pandas as pd

In [2]:
user_cols = ['user_id', 'age', 'gender', 'occupation', 'zip_code']

movieusers_df = pd.read_csv('../data/movie-users.csv', sep = '|', header = None, names = user_cols, index_col = 'user_id')
movieusers_df.head(3)

         age gender  occupation zip_code
user_id
1         24      M  technician    85711
2         53      F       other    94043
3         23      M      writer    32067

In [3]:
movieusers_df.zip_code.duplicated().sum()

148

In [4]:
movieusers_df.duplicated().sum()

7

In [5]:
movieusers_df.loc[movieusers_df.duplicated(keep = False), :]    # keep tells if original should be returned as well

         age gender occupation zip_code
user_id
67        17      M    student    60402
85        51      M   educator    20003
198       21      F    student    55414
350       32      M    student    97301
428       28      M    student    55414
437       27      F      other    20009
460       44      F      other    60630
496       21      F    student    55414
572       51      M   educator    20003
621       17      M    student    60402
684       28      M    student    55414
733       44      F      other    60630
805       27      F      other    20009
890       32      M    student    97301

In [6]:
movieusers_df.shape

(943, 4)

In [7]:
movieusers_df.drop_duplicates().shape    # Dry running to check how much will be removed

(936, 4)

In [8]:
movieusers_df.drop_duplicates(subset = ['age', 'zip_code']).shape    # Specific columns can be targeted as well

(927, 4)